# Description:
#   西木野真姫bot
#
# Commands:
#   :maki / @maki - ランダムでなんかしゃべる

cure_nishikino = [
  "＜これからだよ〜ッ",
  "24日の夜におとなしく寝てたら、枕元に私がいるかもよ💝",
  "そんなわけあるか〜！",
  "でも、こんなことでは真姫は諦めません！",
  "凛だってしたことな〜いにゃ",
  "お〜い💖 私達の大切な、大大大〜好きのダーリン💖 起きてくださ〜い💖💖💖",
  "エリーが勉強好きなんて聞いたことないけど？",
  "💖💖KiRa-KiRa💖💖",
  "みんなもおいでよ〜〜ッ（♥ω♥）",
  "いいから大人しく着替えて。",
  "希ちゃんの占いなんて当てにならないわよ",
  "今日はあなたを囲んで、みんなで一緒に勉強会です",
  "もう、お肉お肉うるさいわよ穂乃果",
  "かわいいだけじゃアイドルだってやっていけないのよ！",
  "これっきり…かもね",
  "はあ！？ なんで私が！",
  "べ、別にいいけど‼︎",
  "ちょっと、何騒いでるのよ。外まで聞こえてるんだけど。",
  "脱いで、うみちゃん。",
  "いまお風呂よ http://38.media.tumblr.com/1e87f98afe9d6e707ad73246af238b18/tumblr_n785rffmmT1s5f9ado1_500.gif",
  "学校でお泊り会よ http://37.media.tumblr.com/88164a0950cee5707a41cf1865682ac6/tumblr_n7l2gkbyEw1s4qvrdo1_500.gif",
  "ちょっと！ http://37.media.tumblr.com/78d253d7b0dfbb950f893bb7ea4c0530/tumblr_n6v199Ntiu1s74h99o2_500.gif",
  "おい！お前ら！ニコニーするぞ！！！１",
  "みんな〜〜〜聴いてね〜〜〜🎵🎵",
  "今はラブライブに集中 💖",
  "それはそれでプレッシャーね。",
  "卒業するまでは部長でしょう？💓",
  "にこちゃんたちのいないμ’sなんて嫌なの！",
  "子供ね。私は美術館。",
  "ちょっと、そういう話は…",
  "Dancing💃stars🌟on👆me👰",
  "（願いましょう）願いましょう💖",
  "🌟🌟Dancing stars on me🌟🌟",
  "もっともっと踊らせて👏👏",
  "どこへでも💝",
  "おいでやす〜〜♨",
  "また欲張りなお願いしてたんでしょ〜",
  "おめでとうにゃ💖",
  "（音楽が大好きで…🎤）",
  "神様のいたずらかな…💖",
  "いいんじゃない👏👏",
  "カツサンドよッ http://24.media.tumblr.com/741abc196d0d14f1d099cd4e86a81bbf/tumblr_n6js6sodGO1r54lc0o1_500.gif",
  "がんばろうよ〜🌟🌟🌟",
  "みんな私のこと泣かないと思ってるでしょ",
  "「お米が大好きで」",
  "寒いにゃぁ〜〜〜〜〜〜",
  "ためらってもダメだね〜🙅",
  "🌟ときめき🌟",
  "遠慮せんと入って💁",
  "はい、これ。いいから受けとんなさいよぉ🍫",
  "穂乃果ちゃんたち3人が頑張って生徒会はピンチを脱出👍 ダイエットも成功🙆 そしていよいよ最終予選がやって来るよ👑",
  "とは言うものの、A-RISEを意識しすぎて、新しいことにチャレンジするも、どれも空回り。",
  "秋と言ったら、なんといっても新米の季節です🍚",
  "何の用ですか〜ッ",
  "では最初にストレッチから始めていきますわ🌟",
  "新たなμ’sを見ていくがいい！",
  "がんばるぞい",
  "やっべ、遅刻しちまうぜ。",
  "飲みに行くぞ",
  "泣けるにゃあ〜",
  "へ〜〜んし〜〜ん♥♡",
  "http://t.co/DEbPJ50KyD",
  "なんとかしなきゃ",
  "♡♥♡プランタンです♡♥♡",
  "それろ〜〜〜それろ〜〜〜",
  "ワイワイワイ",
  "やんやんっ♡♡",
  "ないやん",
  "絢瀬絵里よ、西木野真姫君",
  "http://t.co/Z0Zr79bxHM",
  "べ、別にそんなこと、言った覚え、ないやん",
  "そうにゃそうにゃ",
  "妹達に嘘をついていたニコっち。そこには悲しい過去が。",
  "余程のうぬぼれ屋でもない限り、自分より他人のほうが可愛いって思ってるものでしょう？",
  "バレンタインチョコであります",
  "そうそう、絢瀬絢瀬",
  "凛がリーダ〜〜〜〜！！！？",
  "中見てごらんなさい♡",
  "どうしても手料理を食べさせたい相手がいる、とか…",
  "こら〜、真似しないの！",
  "Chance♡ for♡ me♡",
  "にこちゃんはラブライブどうするの",
  "もー、なんで先に帰っちゃうのよお",
  "（ふふふ、マッキー♡）",
  "てゆうか、今日のにこちゃんおかしくない？ 　おかしいわよ、なんだか、わたしのことずっと避けてるみたいだし",
  "にこちゃん、そんな風だから女の子にモテないのよお",
  "これからもずっとみんな一緒。私達の絆は永遠よ♡",
  "ひょっとして、にこちゃん、好きな人ができたの…？",
  "はい、あげる。バレンタインの──チョコレート。中は冷たくて甘いイチゴチョコなの。だからすぐ食べてね。",
  "♡♥♡はいはいはいっ♥♡♥",
  "ふと立ちどまり（ふっふふー！）",
  "「「ススピリチュアルパパワー」」",
  "ねがいを叶える1枚っ♡♡♡♡",
  "(せ〜のっ) BiBiで〜〜す♡♡♡",
  "終わらないパーティはまだまだ続くわよ！ みんな、ついて来てね♡",
  "いいやん♡",
  "希、日記書けたかしら",
  "にこちゃんどこ……",
  "ほらにこちゃんバンザイして",
  "にゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃんにゃん",
  "へえ、あんたの得意料理もカップラーメンなんだ",
  "まきニーやめろ!!!!!!!!!!!!!!!!!!!!!!",
  "希は大きくね〜",
  "おいし？ ふふ",
  "なんで来ちゃったのよ、もう",
  "おけおけおっけ〜〜✨",
  "ほ、ほ、ほのかちゃあん",
  "西木野真姫がすべての罪を赦し永遠の承認を与える",
  "み〜〜〜んなのことが、ず〜〜〜っと♡♡♡♡♡",
  "やっぱりニコニーいじりは楽しいっ♡",
  "やはりニコマキは真実！",
  "私服もかわいいマッキーよ",
  "わんわん",
  "スクールアイドルです。なんでも聞いてください。",
  "海未〜、目を開けちゃだめよ、だめだからね〜",
  "眠かったら、寝ちゃったほうがいいんじゃな〜い？？",
  "だから新幹線の端から端まで歩けば、目的の駅に着いちゃうのだ♡",
  "私はただもう1回勝負したいだけだけど!!",
  "我こそは西木野真姫",
  "負けっぱなしとか言われたくないんだけど!",
  "!!!!!!!待ちなさい!!!!!!!!!",
  "♡♡♡♡♡たいへんっ 駅までだっしゅ！♡♡♡♡♡",
  "うぇうう、",
  "海未の寝言なんてどうでもいいじゃない",
  "うん♡　終わらない、パーティーのね♡",
  "ぱれ〜〜〜↑↑↑どにさそわ〜〜↑↑れて〜〜〜〜↑↑↑↑",
  "（それぞれがすー）この番組は、",
  "に、にこ、にこちゃんが、にこちゃん、",
  "（こと）（ほの）",
  "日記では素直なの",
  "ハラショ〜〜〜〜〜〜",
  "（こと）（ほの）＼まき♡／",
  "にゃん",
  "気候がいいと勉強もはかどるわね",
  "ちょっとやる気が足りないんじゃないの〜？",
  "に、っっっにこっっっにこちゃん！",
  "ぷわぷわぷわぷわ♡",
  "ラブライブ♡",
  "撮らないで！",
  "は、はぁ〜??",
  "がお〜〜",
  "はぁ〜？ 遅れそうです〜〜？",
  "終わらないパーティーまだ始まらないのお〜〜？",
  "………（あっ！ にこちゃんだ！）",
  "R*in☆*",
  "学校の許可ぁ？認められないわぁ",
  "ちょっとあんたたち！！真姫ちゃんはにこと付き合ってるのよ！！",
  "「って、なんで俺くんが！？",
  "マキ、15歳♡　あ、こう見えて彼氏いない歴17年よ！",
  "近況よ！ http://t.co/MalZM27Y3H",
  "任せといて",
  "ラブライブで一番可愛いマッキーにちゅんちゅんしてほしいの？ くすくす♡",
  "凛、今日放課後ご飯食べに行かない？",
  "ホラさっさとちゅんちゅんしてみなさいよ",
  "♡♡♡わんっ♡♡♡",
  "っっっあっっ♡♡♡",
  "なりきりbotじゃないんで!!!",
  "今日も今日とてアイドル活動♡",
  "急に穂乃果がかわいい",
  "アイドル活動を通じて自分達の通う学校を盛り上げようと頑張る9人の少女達の物語、それが〜♡",
  "ちゅんちゅん♡　ちゅんちゅん♡",
  "ぢゅん〜〜〜〜〜!!!!!!!!!",
  "ファイトだよっ♡",
  "ねむいちゅん",
  "ことりはむっつり",
  "ことりちゃん、ごめん！ 私、ことりちゃんと一緒に飲みたいの！",
  "なかあて！なかあてが熱いと思いますが！",
  "わたしもぷわぷわしたかったわ",
  "にこちゃん、その、な、なんでもない",
  "し、仕方ないわね〜っ",
  "来てくれてありがとう♡ ずっとわたしから目を離さないで見ていてね♡",
  "2期ではことりともっと仲良くなりたいわね",
  "な↑に↓するのよ〜！",
  "ほの♡",
  "AB型の特徴〜？",
  "L♡O♡V♡E♡",
  "よきにはからえ♡",
  "ま☝(^ω^)☝だ☝(^ω^)☝ま☝(^ω^)☝だ☝(^ω^)☝みんなで♡",
  "わたしが治してあげる♡",
  "そしてアキバでのライブは大成功。目指せラブライブ出場♡",
  "ダァンスで人を魅了したいんでしょう！？",
  "会える日を、ずっとずっと楽しみに待ってたの♡ ことりの全部を見てください♡",
  "センターの座は渡さないんだから",
  "組版上手だねっ♡ ロゴも上手だね♡ それに、デザイナーみたいに可愛い♡",
  "穂乃果ちゃん困ってる♡",
  "はーい西木野真姫役Pileでーす♡",
  "誰だ黒歴史確定って書いた奴！！！",
  "ラブライブ　うっちーえみつん　 Pile 様（五七五）",
  "ぱたぱたぱたぱた♡♡♡",
  "おかえりなさい♡ 穂乃果は、ずっとずーっと会いたくて、待ちぼうけわんこの顔で待ってたよ♡ わんっ♡",
  "そりゃそうだよね、いきなり廃校なんて",
  "にっこにっこに〜つってね",
  "うみちゃん♡ ほのかちゃん♡",
  "わたくしが歌ってさしあげますわ",
  "さてさて、うっちーの罰ゲームの時間だよ",
  "私の夏の完璧なプランに、やり残しなんていう単語はひとつもないわ。",
  "こまったザウルス",
  "でも、みんなに期待されてるって思ったら、リク…みんな！？ みんなに期待されてるって思ったら、リクエストに弱いことりです♡",
  "ことりちゃんそんな子だったんだァ",
  "ハイちゅんちゅん",
  "しっかりしなさいよ、もう",
  "はりきりスタイル",
  "アイドルには芸術的センスも要求されます",
  "おかえり♡ 随分早かったのね…あ、もしかして私に会いたくて、無理して早く帰ってきちゃった、とか？",
  "うっちーが「わかんなくなっちゃった」って言ってるの最高すぎてずっとわかんなくなっててほしい",
  "めでたい",
  "♡♥♡♥♡まかまーかまかろん♡♥♡♥♡",
  "なんてね",
  "(・8・) おやつにするぞ!!!!!!!",
  "エリチカ定時退社しそう",
  "ことりちゃんのワンダーゾーンっていうのひどすぎて面白い",
  "がんばっているかね？？？？？"
]

module.exports = (robot) ->
  robot.hear /:maki|@maki/, (msg) ->
    msg.send msg.random cure_nishikino

  robot.hear /西木野|真姫|マッキー/i, (msg) ->
    msg.send msg.random [
      "マキ、15歳♡　あ、こう見えて彼氏いない歴17年よ！",
      "な、なによぉ",
      "私服もかわいいマッキーよ",
      "なりきりbotじゃないんで!!!"
    ]

  robot.hear /ラブライブ/i, (msg) ->
    msg.send msg.random [
      "今はラブライブに集中💖",
      "にこちゃんはラブライブどうするの",
      "そしてアキバでのライブは大成功。目指せラブライブ出場♡",
      "ラブライブ　うっちーえみつん　 Pile 様（五七五）"
    ]

  robot.hear /(眠|ねむ)い/i, (msg) ->
    msg.send msg.random [
      "お〜い💖 私達の大切な、大大大〜好きのダーリン💖 起きてくださ〜い💖💖💖",
      "ねむいちゅん",
      "眠かったら、寝ちゃったほうがいいんじゃな〜い？？",
      "海未の寝言なんてどうでもいいじゃない"
    ]

  robot.hear /(お腹|おなか)すいた|(腹|はら)(減|へ)/i, (msg) ->
    msg.send msg.random [
      "(・8・) おやつにするぞ!!!!!!!",
      "もう、お肉お肉うるさいわよ穂乃果",
      "カツサンドよッ http://24.media.tumblr.com/741abc196d0d14f1d099cd4e86a81bbf/tumblr_n6js6sodGO1r54lc0o1_500.gif",
      "凛、今日放課後ご飯食べに行かない？",
      "どうしても手料理を食べさせたい相手がいる、とか…",
      "秋と言ったら、なんといっても新米の季節です🍚"
    ]

  robot.hear /にこ|矢澤/i, (msg) ->
    msg.send msg.random [
      "おい！お前ら！ニコニーするぞ！！！１",
      "にっこにっこに〜つってね",
      "ちょっとあんたたち！！真姫ちゃんはにこと付き合ってるのよ！！",
      "に、にこ、にこちゃんが、にこちゃん、",
      "に、っっっにこっっっにこちゃん！",
      "やっぱりニコニーいじりは楽しいっ♡",
      "やはりニコマキは真実！",
      "にこちゃんたちのいないμ’sなんて嫌なの！",
      "ほらにこちゃんバンザイして",
      "にこちゃんはラブライブどうするの",
      "………（あっ！ にこちゃんだ！）"
    ]

  robot.hear /穂乃果|ほのか/i, (msg) ->
    msg.send msg.random [
      "こまったザウルス",
      "ほの♡",
      "（こと）（ほの）＼まき♡／",
      "もう、お肉お肉うるさいわよ穂乃果",
      "そりゃそうだよね、いきなり廃校なんて"
    ]

  robot.hear /ことり/i, (msg) ->
    msg.send msg.random [
      "♡♥♡♥♡まかまーかまかろん♡♥♡♥♡",
      "(・8・) おやつにするぞ!!!!!!!",
      "ことりちゃんそんな子だったんだァ",
      "ぱたぱたぱたぱた♡♡♡",
      "会える日を、ずっとずっと楽しみに待ってたの♡ ことりの全部を見てください♡",
      "うみちゃん♡ ほのかちゃん♡",
      "2期ではことりともっと仲良くなりたいわね",
      "ことりちゃん、ごめん！ 私、ことりちゃんと一緒に飲みたいの！"
    ]

  robot.hear /うみ|海未/i, (msg) ->
    msg.send msg.random [
      "脱いで、うみちゃん。",
      "海未、歌詞できた？",
      "せっかくなんだし海未と二人で何処かに行きたいわね",
      "うみちゃん♡ ほのかちゃん♡",
      "うみまきも悪くないわね"
    ]

  robot.hear /Pile/i, (msg) ->
    msg.send msg.random [
      "はーい西木野真姫役Pileでーす♡",
      "みんな私のこと泣かないと思ってるでしょ"
    ]

  robot.hear /良い/i, (msg) ->
    msg.send msg.random [
      "ええやん💖",
      "良いんじゃないかしら"
    ]

  robot.hear /疲れ/i, (msg) ->
    msg.send msg.random [
      "お疲れさま💕",
      "良いんじゃないかしら",
      "ファイトだよっ",
      "しっかりしなさいよ、もう"
    ]

  robot.hear /アイドル/i, (msg) ->
    msg.send msg.random [
      "今日も今日とてアイドル活動♡",
      "アイドル活動を通じて自分達の通う学校を盛り上げようと頑張る9人の少女達の物語、それが〜♡",
      "アイドルには芸術的センスも要求されます"
    ]
